Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide
The values that determine on which side(s) the mark tag text is shown.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide.ShowOnBothSides
Show on both sides.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide.ShowOnLeftSideOnly
Show only on the left side.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide.ShowOnRightSideOnly
Show only on the right side.